In [5]:
import pandas as pd
import numpy as np

In [29]:
df1 = pd.read_csv("Placement_Data_Full_Class.csv")

In [30]:
df1.columns

Index(['sl_no', 'gender', 'ssc_p', 'ssc_b', 'hsc_p', 'hsc_b', 'hsc_s',
       'degree_p', 'degree_t', 'workex', 'etest_p', 'specialisation', 'mba_p',
       'status', 'salary'],
      dtype='object')

In [35]:
df1

,sl_no,gender,ssc_p,ssc_b,hsc_p,hsc_b,hsc_s,degree_p,degree_t,workex,etest_p,specialisation,mba_p,status,salary
0,1,M,67.00,Others,91.00,Others,Commerce,58.00,Sci&Tech,No,55.0,Mkt&HR,58.80,Placed,270000.0
1,2,M,79.33,Central,78.33,Others,Science,77.48,Sci&Tech,Yes,86.5,Mkt&Fin,66.28,Placed,200000.0
2,3,M,65.00,Central,68.00,Central,Arts,64.00,Comm&Mgmt,No,75.0,Mkt&Fin,57.80,Placed,250000.0
3,4,M,56.00,Central,52.00,Central,Science,52.00,Sci&Tech,No,66.0,Mkt&HR,59.43,Not Placed,NaN
4,5,M,85.80,Central,73.60,Central,Commerce,73.30,Comm&Mgmt,No,96.8,Mkt&Fin,55.50,Placed,425000.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
210,211,M,80.60,Others,82.00,Others,Commerce,77.60,Comm&Mgmt,No,91.0,Mkt&Fin,74.49,Placed,400000.0
211,212,M,58.00,Others,60.00,Others,Science,72.00,Sci&Tech,No,74.0,Mkt&Fin,53.62,Placed,275000.0
212,213,M,67.00,Others,67.00,Others,Commerce,73.00,Comm&Mgmt,Yes,59.0,Mkt&Fin,69.72,Placed,295000.0
213,214,F,74.00,Others,66.00,Others,Commerce,58.00,Comm&Mgmt,No,70.0,Mkt&HR,60.23,Placed,204000.0
214,215,M,62.00,Central,58.00,Others,Science,53.00,Comm&Mgmt,No,89.0,Mkt&HR,60.22,Not Placed,NaN

In [36]:
print(type(df.shape[1]))

<class 'int'>

In [38]:
df1.columns

Index(['sl_no', 'gender', 'ssc_p', 'ssc_b', 'hsc_p', 'hsc_b', 'hsc_s',
       'degree_p', 'degree_t', 'workex', 'etest_p', 'specialisation', 'mba_p',
       'status', 'salary'],
      dtype='object')

In [59]:
df1["ssc_p"].groupby(by = df1["gender"]).mean()

gender
F    68.310921
M    66.752518
Name: ssc_p, dtype: float64

In [40]:
df1.groupby(by= "specialisation").mean(numeric_only=True)

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
specialisation,,,,,,,
Mkt&Fin,105.425000,68.961667,68.670583,67.796083,74.885500,62.825667,298852.631579
Mkt&HR,111.252632,65.208737,63.380632,64.569053,68.582737,61.586632,270377.358491

In [41]:
df1.groupby(by= "gender").mean(numeric_only=True)

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
gender,,,,,,,
F,101.763158,68.310921,66.646842,68.090000,70.590658,64.643553,267291.666667
M,111.410072,66.752518,66.161655,65.429856,72.926115,60.984892,298910.000000

In [52]:
df1.groupby(by = ["status", "gender", "degree_t"]).count()

                             sl_no  ssc_p  ssc_b  hsc_p  hsc_b  hsc_s  \
status     gender degree_t
Not Placed F      Comm&Mgmt     20     20     20     20     20     20
                  Others         2      2      2      2      2      2
                  Sci&Tech       6      6      6      6      6      6
           M      Comm&Mgmt     23     23     23     23     23     23
                  Others         4      4      4      4      4      4
                  Sci&Tech      12     12     12     12     12     12
Placed     F      Comm&Mgmt     33     33     33     33     33     33
                  Others         4      4      4      4      4      4
                  Sci&Tech      11     11     11     11     11     11
           M      Comm&Mgmt     69     69     69     69     69     69
                  Others         1      1      1      1      1      1
                  Sci&Tech      30     30     30     30     30     30

                             degree_p  workex  etest_p  specialisation  mba_p  \
status     gender degree_t
Not Placed F      Comm&Mgmt        20      20       20              20     20
                  Others            2       2        2               2      2
                  Sci&Tech          6       6        6               6      6
           M      Comm&Mgmt        23      23       23              23     23
                  Others            4       4        4               4      4
                  Sci&Tech         12      12       12              12     12
Placed     F      Comm&Mgmt        33      33       33              33     33
                  Others            4       4        4               4      4
                  Sci&Tech         11      11       11              11     11
           M      Comm&Mgmt        69      69       69              69     69
                  Others            1       1        1               1      1
                  Sci&Tech         30      30       30              30     30

                             salary
status     gender degree_t
Not Placed F      Comm&Mgmt       0
                  Others          0
                  Sci&Tech        0
           M      Comm&Mgmt       0
                  Others          0
                  Sci&Tech        0
Placed     F      Comm&Mgmt      33
                  Others          4
                  Sci&Tech       11
           M      Comm&Mgmt      69
                  Others          1
                  Sci&Tech       30

In [63]:
df1.groupby(by=["status", "gender", "degree_t"]).mean(numeric_only = True)

                                  sl_no      ssc_p      hsc_p   degree_p  \
status     gender degree_t
Not Placed F      Comm&Mgmt  105.250000  55.742000  62.221500  63.714500
                  Others     124.500000  58.500000  53.500000  58.500000
                  Sci&Tech    96.833333  68.583333  57.000000  65.816667
           M      Comm&Mgmt  118.173913  55.720435  56.903478  58.003478
                  Others      87.250000  55.650000  51.500000  58.500000
                  Sci&Tech   116.666667  58.995000  58.690833  61.810000
Placed     F      Comm&Mgmt   92.424242  72.661515  72.188788  70.684242
                  Others     165.250000  74.975000  69.500000  63.000000
                  Sci&Tech    98.909091  77.323636  64.681818  73.097273
           M      Comm&Mgmt  109.231884  69.120580  69.658551  67.514493
                  Others     125.000000  67.000000  71.000000  64.330000
                  Sci&Tech   111.900000  74.339000  69.998667  68.737333

                               etest_p      mba_p         salary
status     gender degree_t
Not Placed F      Comm&Mgmt  69.907500  64.983500            NaN
                  Others     76.500000  64.035000            NaN
                  Sci&Tech   69.750000  63.923333            NaN
           M      Comm&Mgmt  70.226957  58.780000            NaN
                  Others     70.360000  58.217500            NaN
                  Sci&Tech   66.340000  60.997500            NaN
Placed     F      Comm&Mgmt  70.712727  64.773939  266303.030303
                  Others     74.750000  63.230000  288000.000000
                  Sci&Tech   69.338182  64.651818  262727.272727
           M      Comm&Mgmt  73.782174  60.598986  284521.739130
                  Others     64.000000  61.260000  250000.000000
                  Sci&Tech   76.300667  63.917667  333633.333333

In [65]:
df1.groupby(by=["status", "gender", "degree_t"])[["ssc_p"]].mean()

                                 ssc_p
status     gender degree_t
Not Placed F      Comm&Mgmt  55.742000
                  Others     58.500000
                  Sci&Tech   68.583333
           M      Comm&Mgmt  55.720435
                  Others     55.650000
                  Sci&Tech   58.995000
Placed     F      Comm&Mgmt  72.661515
                  Others     74.975000
                  Sci&Tech   77.323636
           M      Comm&Mgmt  69.120580
                  Others     67.000000
                  Sci&Tech   74.339000

In [51]:
df1.groupby(by = ["status", "gender","specialisation","degree_t", "hsc_s"]).mean(numeric_only= True)

                                                          sl_no      ssc_p  \
status     gender specialisation degree_t  hsc_s
Not Placed F      Mkt&Fin        Comm&Mgmt Arts      137.000000  47.000000
                                           Commerce  110.375000  57.172500
                  Mkt&HR         Comm&Mgmt Commerce  102.000000  56.196250
                                           Science    89.666667  53.630000
                                 Others    Arts       50.000000  50.000000
                                           Commerce  199.000000  67.000000
                                 Sci&Tech  Commerce   69.000000  69.700000
                                           Science   102.400000  68.360000
           M      Mkt&Fin        Comm&Mgmt Arts      145.000000  52.000000
                                           Commerce   96.428571  58.542857
                                           Science   207.000000  41.000000
                                 Others    Arts      183.000000  52.000000
                                           Science    43.000000  49.000000
                                 Sci&Tech  Commerce  100.000000  54.000000
                                           Science   110.000000  62.745000
                  Mkt&HR         Comm&Mgmt Arts      150.000000  44.000000
                                           Commerce   99.375000  55.071250
                                           Science   149.200000  58.840000
                                 Others    Science    61.500000  60.800000
                                 Sci&Tech  Science   122.857143  57.565714
Placed     F      Mkt&Fin        Comm&Mgmt Arts      100.000000  66.500000
                                           Commerce   96.000000  76.026667
                                           Science    85.000000  74.057500
                                 Others    Arts      149.000000  77.000000
                                           Science   132.000000  74.900000
                                 Sci&Tech  Science   101.200000  80.060000
                  Mkt&HR         Comm&Mgmt Commerce   94.428571  66.000000
                                           Science    81.800000  73.240000
                                 Others    Arts      194.000000  60.000000
                                           Science   186.000000  88.000000
                                 Sci&Tech  Science    97.000000  75.043333
           M      Mkt&Fin        Comm&Mgmt Arts       11.500000  62.500000
                                           Commerce  110.820513  69.889231
                                           Science   103.666667  72.426667
                                 Sci&Tech  Science   105.200000  72.758500
                  Mkt&HR         Comm&Mgmt Commerce  122.352941  67.334118
                                           Science    98.000000  67.880000
                                 Others    Science   125.000000  67.000000
                                 Sci&Tech  Commerce    1.000000  67.000000
                                           Science   139.111111  78.666667

                                                         hsc_p   degree_p  \
status     gender specialisation degree_t  hsc_s
Not Placed F      Mkt&Fin        Comm&Mgmt Arts      59.000000  64.000000
                                           Commerce  65.428750  64.925000
                  Mkt&HR         Comm&Mgmt Commerce  59.377500  61.911250
                                           Science   62.326667  65.200000
                                 Others    Arts      37.000000  52.000000
                                           Commerce  70.000000  65.000000
                                 Sci&Tech  Commerce  47.000000  72.700000
                                           Science   59.000000  64.440000
           M      Mkt&Fin        Comm&Mgmt Arts      50.000000  61.000000
                                           Commerce  59.285714  60.097143
                                           Science   42.000000  60.000000
                                 Others    Arts      65.000000  57.000000
                                           Science   39.000000  65.000000
                                 Sci&Tech  Commerce  82.000000  63.000000
                                           Science   56.200000  63.062500
                  Mkt&HR         Comm&Mgmt Arts      58.000000  55.000000
                                           Commerce  58.972500  56.300000
                                           Science   54.400000  57.400000
                                 Others    Science   51.000000  56.000000
                                 Sci&Tech  Science   56.784286  60.924286
Placed     F      Mkt&Fin        Comm&Mgmt Arts      68.600000  70.615000
                                           Commerce  79.222000  72.903333
                                           Science   66.750000  72.250000
                                 Others    Arts      86.000000  56.000000
                                           Science   57.000000  62.000000
                                 Sci&Tech  Science   61.940000  72.928000
                  Mkt&HR         Comm&Mgmt Commerce  68.928571  66.771429
                                           Science   61.440000  68.280000
                                 Others    Arts      63.000000  56.000000
                                           Science   72.000000  78.000000
                                 Sci&Tech  Science   66.966667  73.238333
           M      Mkt&Fin        Comm&Mgmt Arts      67.500000  67.000000
                                           Commerce  71.654103  67.887949
                                           Science   64.333333  69.500000
                                 Sci&Tech  Science   68.975000  68.407500
                  Mkt&HR         Comm&Mgmt Commerce  68.019412  66.404118
                                           Science   66.920000  66.200000
                                 Others    Science   71.000000  64.330000
                                 Sci&Tech  Commerce  91.000000  58.000000
                                           Science   69.940000  70.663333

                                                       etest_p      mba_p  \
status     gender specialisation degree_t  hsc_s
Not Placed F      Mkt&Fin        Comm&Mgmt Arts      78.000000  61.580000
                                           Commerce  73.105000  65.232500
                  Mkt&HR         Comm&Mgmt Commerce  64.081250  64.580000
                                           Science   74.220000  66.530000
                                 Others    Arts      65.000000  56.110000
                                           Commerce  88.000000  71.960000
                                 Sci&Tech  Commerce  79.000000  59.240000
                                           Science   67.900000  64.860000
           M      Mkt&Fin        Comm&Mgmt Arts      60.000000  58.520000
                                           Commerce  68.142857  57.201429
                                           Science   97.000000  53.390000
                                 Others    Arts      75.000000  59.810000
                                           Science   63.000000  51.210000
                                 Sci&Tech  Commerce  50.000000  59.470000
                                           Science   61.025000  63.712500
                  Mkt&HR         Comm&Mgmt Arts      64.250000  58.540000
                                           Commerce  65.785000  60.576250
                                           Science   78.138000  59.294000
                                 Others    Science   71.720000  60.925000
                                 Sci&Tech  Science   71.711429  59.664286
Placed     F      Mkt&Fin        Comm&Mgmt Arts      70.700000  67.635000
                                           Commerce  76.362000  67.277333
                                           Science   78.750000  64.297500
                                 Others    Arts      57.000000  64.080000
                                           Science   80.000000  60.780000
                                 Sci&Tech  Science   83.000000  65.706000
                  Mkt&HR         Comm&Mgmt Commerce  60.555714  60.927143
                                           Science   61.560000  61.886000
                                 Others    Arts      80.000000  56.630000
                                           Science   82.000000  71.430000
                                 Sci&Tech  Science   57.953333  63.773333
           M      Mkt&Fin        Comm&Mgmt Arts      62.740000  67.845000
                                           Commerce  76.871026  61.548974
                                           Science   76.250000  61.361667
                                 Sci&Tech  Science   76.127000  62.935000
                  Mkt&HR         Comm&Mgmt Commerce  69.200000  58.677059
                                           Science   66.724000  55.910000
                                 Others    Science   64.000000  61.260000
                                 Sci&Tech  Commerce  55.000000  58.800000
                                           Science   79.053333  66.670000

                                                            salary
status     gender specialisation degree_t  hsc_s
Not Placed F      Mkt&Fin        Comm&Mgmt Arts                NaN
                                           Commerce            NaN
                  Mkt&HR         Comm&Mgmt Commerce            NaN
                                           Science             NaN
                                 Others    Arts                NaN
                                           Commerce            NaN
                                 Sci&Tech  Commerce            NaN
                                           Science             NaN
           M      Mkt&Fin        Comm&Mgmt Arts                NaN
                                           Commerce            NaN
                                           Science             NaN
                                 Others    Arts                NaN
                                           Science             NaN
                                 Sci&Tech  Commerce            NaN
                                           Science             NaN
                  Mkt&HR         Comm&Mgmt Arts                NaN
                                           Commerce            NaN
                                           Science             NaN
                                 Others    Science             NaN
                                 Sci&Tech  Science             NaN
Placed     F      Mkt&Fin        Comm&Mgmt Arts      233000.000000
                                           Commerce  300533.333333
                                           Science   251500.000000
                                 Others    Arts      240000.000000
                                           Science   360000.000000
                                 Sci&Tech  Science   248000.000000
                  Mkt&HR         Comm&Mgmt Commerce  243142.857143
                                           Science   221200.000000
                                 Others    Arts      300000.000000
                                           Science   252000.000000
                                 Sci&Tech  Science   275000.000000
           M      Mkt&Fin        Comm&Mgmt Arts      243000.000000
                                           Commerce  299358.974359
                                           Science   263666.666667
                                 Sci&Tech  Science   341400.000000
                  Mkt&HR         Comm&Mgmt Commerce  267705.882353
                                           Science   267600.000000
                                 Others    Science   250000.000000
                                 Sci&Tech  Commerce  270000.000000
                                           Science   323444.444444

In [47]:
df1.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
sl_no,215.0,NaN,NaN,NaN,108.0,62.209324,1.0,54.5,108.0,161.5,215.0
gender,215,2,M,139,NaN,NaN,NaN,NaN,NaN,NaN,NaN
ssc_p,215.0,NaN,NaN,NaN,67.303395,10.827205,40.89,60.6,67.0,75.7,89.4
ssc_b,215,2,Central,116,NaN,NaN,NaN,NaN,NaN,NaN,NaN
hsc_p,215.0,NaN,NaN,NaN,66.333163,10.897509,37.0,60.9,65.0,73.0,97.7
hsc_b,215,2,Others,131,NaN,NaN,NaN,NaN,NaN,NaN,NaN
hsc_s,215,3,Commerce,113,NaN,NaN,NaN,NaN,NaN,NaN,NaN
degree_p,215.0,NaN,NaN,NaN,66.370186,7.358743,50.0,61.0,66.0,72.0,91.0
degree_t,215,3,Comm&Mgmt,145,NaN,NaN,NaN,NaN,NaN,NaN,NaN
workex,215,2,No,141,NaN,NaN,NaN,NaN,NaN,NaN,NaN
etest_p,215.0,NaN,NaN,NaN,72.100558,13.275956,50.0,60.0,71.0,83.5,98.0
specialisation,215,2,Mkt&Fin,120,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mba_p,215.0,NaN,NaN,NaN,62.278186,5.833385,51.21,57.945,62.0,66.255,77.89
status,215,2,Placed,148,NaN,NaN,NaN,NaN,NaN,NaN,NaN
salary,148.0,NaN,NaN,NaN,288655.405405,93457.45242,200000.0,240000.0,265000.0,300000.0,940000.0

In [26]:
data = {
    "key1": ["a", "b", "a", "b", "a", "c"],
    "key2": ["one", "two", "three", "one", "two", "three"],
    "data1": np.random.randint(100, size=6),
    "data2": np.random.randint(100, size=6)
}

In [27]:
df = pd.DataFrame(data)

In [28]:
df

  key1   key2  data1  data2
0    a    one     32      5
1    b    two     84     86
2    a  three     65     86
3    b    one      1      5
4    a    two      0     83
5    c  three     59     13